app/controllers/milestones_controller.rb

	def create
		@milestone = @project.milestones.create(milestone_params)
---
INSERT INTO "milestones" ("content", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "adsfad"], ["project_id", 1], ["created_at", "2017-12-03 23:45:33.834175"], ["updated_at", "2017-12-03 23:45:33.834175"]]

	def destroy
		@milestone = @project.milestones.find(params[:id])
		if @milestone.destroy
---
SELECT  "milestones".* FROM "milestones" WHERE "milestones"."project_id" = ? AND "milestones"."id" = ? LIMIT ?  [["project_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "milestones" WHERE "milestones"."id" = ?  [["id", 3]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]

	def show
		@milestone = @project.milestones.find(params[:id])
---
SELECT  "milestones".* FROM "milestones" WHERE "milestones"."project_id" = ? AND "milestones"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]

def set_project
	@project = Project.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]