app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all

INSERT INTO "projects" ("name", "deadline", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "associated projects"], ["deadline", "2017-12-14"], ["created_at", "2017-12-14 02:08:34.374944"], ["updated_at", "2017-12-14 02:08:34.374944"], ["user_id", 1]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save

UPDATE "projects" SET "name" = ?, "deadline" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Recruit Participants"], ["deadline", "2017-12-09"], ["updated_at", "2017-12-04 04:59:38.985475"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]
---
  def destroy
    @project.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_project
      @project = Project.find(params[:id])