app/controllers/todoitems_controller.rb

	def create
		@project = Project.find(params[:project_id])
		@milestone = Milestone.find(params[:milestone_id])
		@todoitem = @milestone.todoitems.create(todoitems_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "milestones".* FROM "milestones" WHERE "milestones"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "todoitems" ("description", "milestone_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "adsf"], ["milestone_id", 8], ["created_at", "2017-12-04 02:36:47.416406"], ["updated_at", "2017-12-04 02:36:47.416406"]]

	def destroy

		if @todoitem.destroy
---
DELETE FROM "todoitems" WHERE "todoitems"."id" = ?  [["id", 19]]

	def complete
		@project = Project.find(params[:project_id])
		@todoitem.update_attribute(:completed_at, Time.now)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "todoitems" SET "completed_at" = ?, "updated_at" = ? WHERE "todoitems"."id" = ?  [["completed_at", "2017-12-04 05:48:45.576540"], ["updated_at", "2017-12-04 05:48:45.577035"], ["id", 29]]

def set_todoitem
		@todoitem = Todoitem.find(params[:id])
---
SELECT  "todoitems".* FROM "todoitems" WHERE "todoitems"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]